In [1]:
import pandas as pd
df = pd.read_csv('student-mat.csv', sep=';')
df

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,...,4,3,4,1,1,3,6,5,6,6
1,GP,F,17,U,GT3,T,1,1,at_home,other,...,5,3,3,1,1,3,4,5,5,6
2,GP,F,15,U,LE3,T,1,1,at_home,other,...,4,3,2,2,3,3,10,7,8,10
3,GP,F,15,U,GT3,T,4,2,health,services,...,3,2,2,1,1,5,2,15,14,15
4,GP,F,16,U,GT3,T,3,3,other,other,...,4,3,2,1,2,5,4,6,10,10
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
390,MS,M,20,U,LE3,A,2,2,services,services,...,5,5,4,4,5,4,11,9,9,9
391,MS,M,17,U,LE3,T,3,1,services,services,...,2,4,5,3,4,2,3,14,16,16
392,MS,M,21,R,GT3,T,1,1,other,other,...,5,5,3,3,3,3,3,10,8,7
393,MS,M,18,R,LE3,T,3,2,services,other,...,4,4,1,3,4,5,0,11,12,10
394,MS,M,19,U,LE3,T,1,1,other,at_home,...,3,2,3,3,3,5,5,8,9,9

In this describe fucntion we get bunch of row like count, mean and so on. Here count means the number of records with no absense of value more like a count of non-null values in the df. And describe only acts on numberic columns in the DataFrame. Here the other rows like mean is average and std is a standard deviation(how much variation between the data) and min and max are minimum and maximum values and few intermediate value like 25, 50 and 75.

In [2]:
df.describe()

,age,Medu,Fedu,traveltime,studytime,failures,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
count,395.000000,395.000000,395.000000,395.000000,395.000000,395.000000,395.000000,395.000000,395.000000,395.000000,395.000000,395.000000,395.000000,395.000000,395.000000,395.000000
mean,16.696203,2.749367,2.521519,1.448101,2.035443,0.334177,3.944304,3.235443,3.108861,1.481013,2.291139,3.554430,5.708861,10.908861,10.713924,10.415190
std,1.276043,1.094735,1.088201,0.697505,0.839240,0.743651,0.896659,0.998862,1.113278,0.890741,1.287897,1.390303,8.003096,3.319195,3.761505,4.581443
min,15.000000,0.000000,0.000000,1.000000,1.000000,0.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,0.000000,3.000000,0.000000,0.000000
25%,16.000000,2.000000,2.000000,1.000000,1.000000,0.000000,4.000000,3.000000,2.000000,1.000000,1.000000,3.000000,0.000000,8.000000,9.000000,8.000000
50%,17.000000,3.000000,2.000000,1.000000,2.000000,0.000000,4.000000,3.000000,3.000000,1.000000,2.000000,4.000000,4.000000,11.000000,11.000000,11.000000
75%,18.000000,4.000000,3.000000,2.000000,2.000000,0.000000,5.000000,4.000000,4.000000,2.000000,3.000000,5.000000,8.000000,13.000000,13.000000,14.000000
max,22.000000,4.000000,4.000000,4.000000,4.000000,3.000000,5.000000,5.000000,5.000000,5.000000,5.000000,5.000000,75.000000,19.000000,19.000000,20.000000

In [3]:
df.age.describe()

count    395.000000
mean      16.696203
std        1.276043
min       15.000000
25%       16.000000
50%       17.000000
75%       18.000000
max       22.000000
Name: age, dtype: float64

In [4]:
df1 = pd.DataFrame(
    {
        'col1': [ 1, 2, 0, 4],
    }
)
df1.describe()

           col1
count  4.000000
mean   1.750000
std    1.707825
min    0.000000
25%    0.750000
50%    1.500000
75%    2.500000
max    4.000000

In [5]:
df.age.mean().round(2)

np.float64(16.7)

In [6]:
df.age.unique()

array([18, 17, 15, 16, 19, 22, 20, 21])

In [7]:
df.age.value_counts()

age
16    104
17     98
18     82
15     82
19     24
20      3
22      1
21      1
Name: count, dtype: int64

In [8]:
df.age.map(lambda x: x + 2)

0      20
1      19
2      17
3      17
4      18
       ..
390    22
391    19
392    23
393    20
394    21
Name: age, Length: 395, dtype: int64

In [9]:
def change_age(age):
    age_n = age+2
    return age_n

df.age.map(change_age)

0      20
1      19
2      17
3      17
4      18
       ..
390    22
391    19
392    23
393    20
394    21
Name: age, Length: 395, dtype: int64

In [10]:
df_t = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 35],
    "Salary": [1000, 1500, 2000]
})
df_t

      Name  Age  Salary
0    Alice   25    1000
1      Bob   30    1500
2  Charlie   35    2000

In [11]:
df_t['Name'] = df_t["Name"].map({"Alice": "AL", "Bob": "B"}, na_action="ignore")
df_t

  Name  Age  Salary
0   AL   25    1000
1    B   30    1500
2  NaN   35    2000

In [12]:
s = pd.Series([1, 2, 3, None])
s.map(lambda x: f'this is a string {x}', na_action=None)

0    this is a string 1.0
1    this is a string 2.0
2    this is a string 3.0
3    this is a string nan
dtype: object

In [13]:
s.map(lambda x: f'this is a string {x}', na_action='ignore')

0    this is a string 1.0
1    this is a string 2.0
2    this is a string 3.0
3                     NaN
dtype: object

In [14]:
df_t = pd.DataFrame({"A": [1,2,3], "B": [4,5,6]})
df_t.map(lambda x: x*10)

    A   B
0  10  40
1  20  50
2  30  60

In [15]:
df_t = pd.DataFrame({
    "A": [1, 2, 3],
    "B": [4, 5, 6],
    "C": ["x", "y", "z"]
})
df_t[["A", "B"]].apply(lambda col: col * 10)

    A   B
0  10  40
1  20  50
2  30  60

In [16]:
df_t.loc[0:1, ['A', 'B']].apply(lambda col: col*10)

    A   B
0  10  40
1  20  50

In [17]:
df_t.index = ['row1', 'row2', 'row3']
df_t

      A  B  C
row1  1  4  x
row2  2  5  y
row3  3  6  z

In [18]:
df_t.loc[['row1', 'row2'], ['A', 'B']]

      A  B
row1  1  4
row2  2  5

In [19]:
df_t.iloc[0:2, [0, 1]]

      A  B
row1  1  4
row2  2  5

In [20]:
df_t = pd.DataFrame(
    { 'col1': [x for x in 'abc'],
      'col2': [x for x in 'def']
    }
)
df_t

  col1 col2
0    a    d
1    b    e
2    c    f

In [21]:
df_t.col1 * 2

0    aa
1    bb
2    cc
Name: col1, dtype: object

In [22]:
df_t.col1 + '-' + df_t.col2 + '-'+ df_t.col1

0    a-d-a
1    b-e-b
2    c-f-c
dtype: object

In [23]:
df

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,...,4,3,4,1,1,3,6,5,6,6
1,GP,F,17,U,GT3,T,1,1,at_home,other,...,5,3,3,1,1,3,4,5,5,6
2,GP,F,15,U,LE3,T,1,1,at_home,other,...,4,3,2,2,3,3,10,7,8,10
3,GP,F,15,U,GT3,T,4,2,health,services,...,3,2,2,1,1,5,2,15,14,15
4,GP,F,16,U,GT3,T,3,3,other,other,...,4,3,2,1,2,5,4,6,10,10
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
390,MS,M,20,U,LE3,A,2,2,services,services,...,5,5,4,4,5,4,11,9,9,9
391,MS,M,17,U,LE3,T,3,1,services,services,...,2,4,5,3,4,2,3,14,16,16
392,MS,M,21,R,GT3,T,1,1,other,other,...,5,5,3,3,3,3,3,10,8,7
393,MS,M,18,R,LE3,T,3,2,services,other,...,4,4,1,3,4,5,0,11,12,10
394,MS,M,19,U,LE3,T,1,1,other,at_home,...,3,2,3,3,3,5,5,8,9,9

In [24]:
df.groupby(['age']).sum()

,school,sex,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
age,,,,,,,,,,,,,,,,,,,,,
15,GPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGP...,FFMMFFMMMMMFMMMMMMFMFFMMMFMFFMFFFMMFMFFMFMMMMF...,UUUUUUUUUUURUUUURUUURRUUUUUUUUUUUUUUURRURUUUUU...,LE3GT3LE3GT3GT3GT3LE3GT3GT3GT3GT3GT3GT3GT3GT3G...,TTATTTTTATTTTTTTTTTTTTTTTATTTATAATTTATTTTTTTTT...,249,226,at_homehealthservicesotherteacherserviceshealt...,otherservicesotherotherhealthotherservicesothe...,otherhomehomehomereputationreputationcoursecou...,...,328,269,225,111,156,294,274,921,932,923
16,GPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGP...,FMMFFFMMMFMMMMFFFMFFFFFFFFFMMFFFFMMFFFMFFFMMMF...,UUUUUUUUUUUUURUUUUUUURUUUUUUUUUUUUUUUURUUUUUUU...,GT3LE3LE3GT3GT3GT3LE3LE3LE3GT3LE3GT3GT3GT3LE3L...,TTTTTTTTTTATTATTATTATTTTTTTTTTTTTTATTTTTTTTTTT...,294,268,otherservicesotherhealthservicesotherhealthtea...,otherotherotherotherservicesotherotherotheroth...,homereputationhomehomereputationreputationhome...,...,399,336,330,149,237,385,567,1138,1163,1147
17,GPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGP...,FFMMMFMMFMMMMMMMMFFMFMFMFMFFFFFMFFFFFFFFMFFMMM...,UUUURURUURRURUUUUUUUURUUUUUURURURUUUURUUUUURUU...,GT3GT3GT3GT3GT3LE3GT3GT3GT3LE3LE3GT3LE3LE3LE3G...,TATTTTTTTTTTTTTTTTTTATTTTTTTTTTTTTTTTTTTTATTTT...,256,242,at_homeotherservicesotherotherotherat_homeothe...,otherteacherservicesotherotherotherotherothert...,coursehomecoursehomecoursecoursecoursehomecour...,...,383,316,314,149,252,343,633,1068,1027,1007
18,GPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGP...,FMMFMMMFMMFMMMMFMMFMFMFFFFMFMFFFMMMFMFFMFFFFFM...,URURUUURUUURUUUUURURRURUURUUURUUUUUURUUUUUUUUU...,GT3GT3LE3GT3GT3LE3GT3GT3LE3GT3GT3LE3GT3GT3GT3G...,ATTTTTTTTTTTTTTTTTTATTTTTATTTTTTTATTTTTTATTTTT...,222,203,at_homeservicesotherat_homeservicesservicesoth...,teacherotherotherotherotherhealthotherotheroth...,coursereputationcoursecoursehomehomehomereputa...,...,330,256,271,127,198,282,496,879,831,783
19,GPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGPMSMSMSMSMSMS,FMFMFFMMMFFFMFFFFFMMFMFM,UUUUUUUURUUUUUURRURRURRU,GT3GT3GT3LE3GT3GT3GT3GT3GT3LE3LE3GT3GT3LE3GT3G...,TTTATTTTTTTTTTTTATTTTTTT,52,49,at_homeservicesotherservicesotherhealthotherte...,otherat_homeotherat_homeservicesotherotherserv...,coursehomereputationreputationhomereputationho...,...,93,78,70,35,47,84,251,246,222,197
20,GPMSMS,MFM,UUU,GT3GT3LE3,ATA,9,6,serviceshealthservices,otherotherservices,coursecoursecourse,...,15,14,10,6,7,12,15,41,41,42
21,MS,M,R,GT3,T,1,1,other,other,course,...,5,5,3,3,3,3,3,10,8,7
22,GP,M,U,GT3,T,3,1,services,services,other,...,5,4,5,5,5,1,16,6,8,8

In [25]:
df.loc[df.age == 22]

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
247,GP,M,22,U,GT3,T,3,1,services,services,...,5,4,5,5,5,1,16,6,8,8

In [26]:
df.groupby('age').absences.sum()

age
15    274
16    567
17    633
18    496
19    251
20     15
21      3
22     16
Name: absences, dtype: int64

In [27]:
df.groupby('age').absences.min()

age
15     0
16     0
17     0
18     0
19     0
20     0
21     3
22    16
Name: absences, dtype: int64

In [28]:
dfx = pd.DataFrame({'Animal': ['Falcon', 'Falcon',
                              'Parrot', 'Parrot'],
                   'Max Speed': [380., 370., 24., 26.],
                   'Weight': [380., 370., 24., 26.]})
dfx

   Animal  Max Speed  Weight
0  Falcon      380.0   380.0
1  Falcon      370.0   370.0
2  Parrot       24.0    24.0
3  Parrot       26.0    26.0

In [29]:
dfx.groupby(['Animal']).sum()

        Max Speed  Weight
Animal
Falcon      750.0   750.0
Parrot       50.0    50.0

In [30]:
arrays = [['Falcon', 'Falcon', 'Parrot', 'Parrot'],
          ['Captive', 'Wild', 'Captive', 'Wild']]
index = pd.MultiIndex.from_arrays(arrays, names=('Animal', 'Type'))
dfx = pd.DataFrame({'Max Speed': [390., 350., 30., 20.]},
                  index=index)
dfx

                Max Speed
Animal Type
Falcon Captive      390.0
       Wild         350.0
Parrot Captive       30.0
       Wild          20.0

In [31]:
s = pd.Series([1,2,3,4,5])
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [32]:
s.map(lambda x: x+2)

0    3
1    4
2    5
3    6
4    7
dtype: int64

In [33]:
sum(s)

15

In [34]:
s2 = pd.Series([[1, 2], [3, 4], [], [5]])
s2

0    [1, 2]
1    [3, 4]
2        []
3       [5]
dtype: object

In [35]:
s2.apply(sum), sum(s2.apply(sum))

(0    3
 1    7
 2    0
 3    5
 dtype: int64,
 15)

In [36]:
df1 = pd.DataFrame({
    "A": [1, 2, 3],
    "B": [4, 5, 6],
    "C": ["x", "y", "z"]
})
df1[["A", "B"]].apply(lambda col: col * 10)

    A   B
0  10  40
1  20  50
2  30  60

In [37]:
df1[["A", "B"]].map(lambda col: col * 10)

    A   B
0  10  40
1  20  50
2  30  60

In [38]:
def mul10(n):
    print('mul10:', n)
    return n * 10

In [39]:
df1[["A", "B"]].map(mul10)

mul10: 1
mul10: 2
mul10: 3
mul10: 4
mul10: 5
mul10: 6

    A   B
0  10  40
1  20  50
2  30  60

In [40]:
df1[["A", "B"]].apply(mul10)

mul10: 0    1
1    2
2    3
Name: A, dtype: int64
mul10: 0    4
1    5
2    6
Name: B, dtype: int64

    A   B
0  10  40
1  20  50
2  30  60

In [41]:
df1

   A  B  C
0  1  4  x
1  2  5  y
2  3  6  z

In [42]:
df1.iloc[0, [1,2]]

B    4
C    x
Name: 0, dtype: object

In [43]:
df1.loc[1] = [2,3,4]

In [45]:
df1.index = ['a', 'b', 'c']
df1

   A  B  C
a  1  4  x
b  2  3  4
c  3  6  z

In [46]:
df1.loc['e'] = [1, 1, 1]

In [48]:
df1

   A  B  C
a  1  4  x
b  2  3  4
c  3  6  z
e  1  1  1

In [49]:
df1.count()

A    4
B    4
C    4
dtype: int64

In [47]:
import numpy as np

This arange function will generate a list of 12 numbers and this reshape will create a nested list by specifying the row and column value

In [50]:
array = np.arange(12).reshape(4,3)
array

array([[ 0,  1,  2],
       [ 3,  4,  5],
       [ 6,  7,  8],
       [ 9, 10, 11]])

And passing this would to a DataFrame will create a Dataframe object but with autogenerated row and column values

In [51]:
df2 = pd.DataFrame(array)
df2

   0   1   2
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [52]:
df2 = pd.DataFrame(array, columns=['A', 'B', 'C'])
df2

   A   B   C
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [53]:
df2.drop(0)

   A   B   C
1  3   4   5
2  6   7   8
3  9  10  11

In [54]:
df2.count()

A    4
B    4
C    4
dtype: int64

In [55]:
df2.loc[3, 'C'] = None

In [56]:
df2.count()

A    4
B    4
C    3
dtype: int64

In [57]:
df_s = pd.DataFrame({
    "student": ["Alice", "Bob", "Charlie", "David", "Eve"],
    "marks":   [85, 90, 85, 70, 90]
})
df_s

   student  marks
0    Alice     85
1      Bob     90
2  Charlie     85
3    David     70
4      Eve     90

In [58]:
groupby_marks = df_s.groupby('marks')
groupby_marks

In [59]:
grp_85 = groupby_marks.get_group(85)
grp_85, type(grp_85)

(   student  marks
 0    Alice     85
 2  Charlie     85,
 pandas.core.frame.DataFrame)

In [60]:
grp_85.count(), '----', grp_85.student

(student    2
 marks      2
 dtype: int64,
 '----',
 0      Alice
 2    Charlie
 Name: student, dtype: object)

In [61]:
groupby_marks.sum()

            student
marks
70            David
85     AliceCharlie
90           BobEve

In [62]:
df_s['study_hours'] = [3, 4, 3, 2, 9]

In [63]:
df_s

   student  marks  study_hours
0    Alice     85            3
1      Bob     90            4
2  Charlie     85            3
3    David     70            2
4      Eve     90            9

In [64]:
avg_std_hrs = df_s.groupby('marks')['study_hours'].mean()

In [65]:
avg_std_hrs

marks
70    2.0
85    3.0
90    6.5
Name: study_hours, dtype: float64

In [66]:
avg_std_hrs.sort_values(ascending=False)

marks
90    6.5
85    3.0
70    2.0
Name: study_hours, dtype: float64

In [85]:
df_s.study_hours.groupby(df_s.marks).mean().sort_values(ascending=False).sort_index()

marks
70    2.0
85    3.0
90    6.5
Name: study_hours, dtype: float64

In [67]:
s = pd.Series([1,2,3,4,5], index= ['a', 'b', 'c', 'a', 'c'])
s

a    1
b    2
c    3
a    4
c    5
dtype: int64

In [71]:
s.groupby(s.index).sum()

a    5
b    2
c    8
dtype: int64

In [70]:
l = [[1, 2, 3], [1, None, 4], [2, 1, 3], [1, 2, 2]]
df = pd.DataFrame(l, columns=["a", "b", "c"])
df

   a    b  c
0  1  2.0  3
1  1  NaN  4
2  2  1.0  3
3  1  2.0  2